<h1>Кошик - ваші замовлення</h1>
<?php if( empty( $_CONTEXT[ 'user' ] ) ) : ?>
    <p>
        Кошик доступний тільки авторизованим користувачам. Увійдіть до системи.
    </p>
<?php else : 
    if( empty( $_CONTEXT[ 'cart' ] ) ) : ?>
    <p>
        Кошик порожній. Додавайте товари зі 
        <a href="/shop">сторінки магазину</a>
    </p>
    <?php else : ?>
        Тут буде кошик 
        Д.З. Реалізувати відображення даних, одержаних
        по "кошику" у вигляді HTML таблиці.
    <?php print_r($_CONTEXT['orders']) ; endif ?>
<?php endif ?>